Tekla.Structures.CatalogInternal.ShapeHandler.GetShapeMetadata(System.String)
Gets the metadata of a shape
guid: An input parameter that defines the guid of the shape whose metadata we want to get
Returns: Returns a list of key-value pairs that contain the metadata of the shape specified by guid.
using System;
using Tekla.Structures.CatalogInternal;
public class Example
{
var polymesh = CreateBrep();
var shapeItem = new ShapeItem
{
Name = "TestShapeName",
ShapeFacetedBrep = polymesh,
UpAxis = ShapeUpAxis.Z_Axis
};
var result = shapeItem.Insert();
var testPairs1 = new List{Tuple{string, string}}
{
new Tuple{string, string}("TestKey", "TestValue")
};
shapeItem.AppendMetadata(testPairs1));
var MetadataFromCatalog = ShapeHandler.GetShapeMetadata(shapeItem.Guid);
Assert.AreEqual(MetadataFromCatalog, testPairs1);
}